In [1]:
import pandas as pd

创建一个叫name的Series，里面包含字符串元素"小陈","小李","小王","小张","小赵","小周"，标签为"001","002","003","004","005","006"  
创建一个叫gender的Series，里面包含字符串元素"女","女","男","男","女","男"，标签为"006","005","004","003","002","001"  
创建一个叫height的Series，里面包含浮点数元素172.5,168.0,178.2,181.3,161.7，标签为"001","002","003","004","005"

In [2]:
name = pd.Series(["小陈","小李","小王","小张","小赵","小周"],index=["001","002","003","004","005","006"])
gender = pd.Series(["女","女","男","男","女","男"],index=["006","005","004","003","002","001" ])
height = pd.Series([172.5,168.0,178.2,181.3,161.7],index=["001","002","003","004","005" ])
print(name)
print(gender)
print(height)

001    小陈
002    小李
003    小王
004    小张
005    小赵
006    小周
dtype: object
006    女
005    女
004    男
003    男
002    女
001    男
dtype: object
001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
dtype: float64

创建一个叫students的DataFrame,包含列名姓名、性别、身高，数据分别对应name、gender、height。

In [3]:
students = pd.DataFrame({"姓名":name,"性别":gender,"身高":height})
students

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  女    NaN

打印students的索引和列名

In [4]:
print(students.index)
print(students.columns)

Index(['001', '002', '003', '004', '005', '006'], dtype='object')
Index(['姓名', '性别', '身高'], dtype='object')

行列转置

In [5]:
students.T

      001    002    003    004    005  006
姓名     小陈     小李     小王     小张     小赵   小周
性别      男      女      男      男      女    女
身高  172.5  168.0  178.2  181.3  161.7  NaN

输出身高列

In [6]:
students["身高"]

001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
006      NaN
Name: 身高, dtype: float64

输出性别身高列

In [7]:
students[["性别","身高"]]

    性别     身高
001  男  172.5
002  女  168.0
003  男  178.2
004  男  181.3
005  女  161.7
006  女    NaN

输出students索引003的行

In [8]:
students.loc["003"]

姓名       小王
性别        男
身高    178.2
Name: 003, dtype: object

输出students里索引为003，004，005的行

In [9]:
students.loc["003":"005"]

     姓名 性别     身高
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7

输出005的身高

In [10]:
students.loc["005","身高"]

np.float64(161.7)

输出索引为003、005的数据的姓名和身高。

In [11]:
students.loc[["003","005"],["姓名","身高"]]

     姓名     身高
003  小王  178.2
005  小赵  161.7

输出003、005的所有数据变量

In [12]:
students.loc[["003","005"],:]

     姓名 性别     身高
003  小王  男  178.2
005  小赵  女  161.7

输出身高大于165的女性

In [13]:
students[(students["身高"] > 165) & (students["性别"]=="女")]

     姓名 性别     身高
002  小李  女  168.0

通过head方法，输出students前五行数据

In [14]:
students.head(5)

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7

In [15]:
import pandas as pd

创建一个名为students的DataFrame，包含数据  
{"001":{"姓名":"小陈","考试1":85,"考试2":95,"考试3":92},"002":{"姓名":"小李","考试1":91,"考试2":92,"考试3":94}  
"003":{"姓名":"小王","考试1":86,"考试2":81,"考试3":89}，"004":{"姓名":"小张","考试1":79,"考试2":89,"考试3":95}  
"005":{"姓名":"小赵","考试1":96,"考试2":91,"考试3":91}，"006":{"姓名":"小周","考试1":81,"考试2":89,"考试3":92}}

要求索引为学号（001等），列名为姓名，考试1，考试2，考试3，并输出

In [16]:
students_data = {"001":{"姓名":"小陈","考试1":85,"考试2":95,"考试3":92},"002":{"姓名":"小李","考试1":91,"考试2":92,"考试3":94},"003":{"姓名":"小王","考试1":86,"考试2":81,"考试3":89},"004":{"姓名":"小张","考试1":79,"考试2":89,"考试3":95},"005":{"姓名":"小赵","考试1":96,"考试2":91,"考试3":91},"006":{"姓名":"小周","考试1":81,"考试2":89,"考试3":92}}
students = pd.DataFrame(students_data).T
students

     姓名 考试1 考试2 考试3
001  小陈  85  95  92
002  小李  91  92  94
003  小王  86  81  89
004  小张  79  89  95
005  小赵  96  91  91
006  小周  81  89  92

给students增加一列考试4，数据依次为：[72,69,79,83,82,76]

In [17]:
students["考试4"] = [72,69,79,83,82,76]
students

     姓名 考试1 考试2 考试3  考试4
001  小陈  85  95  92   72
002  小李  91  92  94   69
003  小王  86  81  89   79
004  小张  79  89  95   83
005  小赵  96  91  91   82
006  小周  81  89  92   76

给students添加一行，索引为007，数据为"小杨"，79，82，81，69

In [18]:
students.loc["007"] = ["小杨",79,82,81,69]
students

     姓名 考试1 考试2 考试3  考试4
001  小陈  85  95  92   72
002  小李  91  92  94   69
003  小王  86  81  89   79
004  小张  79  89  95   83
005  小赵  96  91  91   82
006  小周  81  89  92   76
007  小杨  79  82  81   69

输出students删除索引为006，007的结果，但不要改变students本身

In [19]:
students.drop(["006","007"],axis=0)

     姓名 考试1 考试2 考试3  考试4
001  小陈  85  95  92   72
002  小李  91  92  94   69
003  小王  86  81  89   79
004  小张  79  89  95   83
005  小赵  96  91  91   82

删除列名为考试2，考试4的结果，不改变本身

In [20]:
students.drop(["考试2","考试4"],axis=1)

     姓名 考试1 考试3
001  小陈  85  92
002  小李  91  94
003  小王  86  89
004  小张  79  95
005  小赵  96  91
006  小周  81  92
007  小杨  79  81

创建一个Series bonus，包含的值和值对应的索引分别为：{"考试1":2,"考试2":3,"考试3":2,"考试4":5}。  
输出这个Series与students里所有分数相加的结果，但不更新students

In [21]:
bonus = pd.Series({"考试1":2,"考试2":3,"考试3":2,"考试4":5})
bonus + students[["考试1","考试2","考试3","考试4"]]

    考试1 考试2 考试3  考试4
001  87  98  94   77
002  93  95  96   74
003  88  84  91   84
004  81  92  97   88
005  98  94  93   87
006  83  92  94   81
007  81  85  83   74

更新students的考试4，让每项数据值加10

In [22]:
students["考试4"] = students["考试4"] + 10
students

     姓名 考试1 考试2 考试3  考试4
001  小陈  85  95  92   82
002  小李  91  92  94   79
003  小王  86  81  89   89
004  小张  79  89  95   93
005  小赵  96  91  91   92
006  小周  81  89  92   86
007  小杨  79  82  81   79

In [35]:
import pandas as pd
import numpy as np

创建一个名为students的DataFrame，包含数据
{"001":{"姓名":"小陈","考试1":85,"考试2":95,"考试3":92},"002":{"姓名":"小李","考试1":91,"考试2":92,"考试3":94}
"003":{"姓名":"小王","考试1":86,"考试2":81,"考试3":89}，"004":{"姓名":"小张","考试1":79,"考试2":89,"考试3":95}
"005":{"姓名":"小赵","考试1":96,"考试2":91,"考试3":91}，"006":{"姓名":"小周","考试1":81,"考试2":89,"考试3":92}}

In [38]:
students = pd.DataFrame({"001":{"姓名":"小陈","考试1":85,"考试2":95,"考试3":92},"002":{"姓名":"小李","考试1":91,"考试2":92,"考试3":94},"003":{"姓名":"小王","考试1":86,"考试2":81,"考试3":89},"004":{"姓名":"小张","考试1":79,"考试2":89,"考试3":95},"005":{"姓名":"小赵","考试1":96,"考试2":91,"考试3":91},"006":{"姓名":"小周","考试1":81,"考试2":89,"考试3":92}}).T
students

     姓名 考试1 考试2 考试3
001  小陈  85  95  92
002  小李  91  92  94
003  小王  86  81  89
004  小张  79  89  95
005  小赵  96  91  91
006  小周  81  89  92

创建一个students_average的DataFrame，索引为学号，包含姓名列，以及计算三次考试平均值后的结果列

In [30]:
average = students.loc[:,"考试1":"考试3"].mean(axis=1)
name = students["姓名"]
students_average = pd.DataFrame({"姓名":name,"平均分":average})
students_average

     姓名        平均分
001  小陈  90.666667
002  小李  92.333333
003  小王  85.333333
004  小张  87.666667
005  小赵  92.666667
006  小周  87.333333

输出每次考试第二高的分数组成的Series，可以尝试结合匿名函数

In [36]:
students.loc[:,"考试1":"考试3"].apply(lambda x: np.sort(x)[-2])

考试1    91
考试2    92
考试3    94
dtype: int64

根据规则输出等级，A+：平均分>=95，A：90<=平均分<=95，B+:[85,90),C+[80,85),C:平均分<75

In [39]:
def get_grade(score):
    if score >=95:
        return"A+"
    elif score >=90:
        return"A"
    elif score >=85:
        return"B+"
    elif score >=80:
        return"B"
    elif score >=75:
        return"C+"
    else:
        return"C"

In [42]:
students.loc[:,"考试1":"考试3"].applymap(get_grade)

C:\Users\王杰\AppData\Local\Temp\ipykernel_20392\1743542357.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  students.loc[:,"考试1":"考试3"].applymap(get_grade)

    考试1 考试2 考试3
001  B+  A+   A
002   A   A   A
003  B+   B  B+
004  C+  B+  A+
005  A+   A   A
006   B  B+   A

展示students每个考试分数数据列的统计信息，包括个数，平均值，标准差，四分位数等。

In [43]:
students.describe()

        姓名  考试1  考试2  考试3
count    6    6    6    6
unique   6    6    5    5
top     小陈   85   89   92
freq     1    1    2    2

In [45]:
students["考试1"] = students["考试1"].astype('int')
students["考试2"] = students["考试2"].astype('int')
students["考试3"] = students["考试3"].astype('int')
students.describe()

             考试1        考试2        考试3
count   6.000000   6.000000   6.000000
mean   86.333333  89.500000  92.166667
std     6.314006   4.722288   2.136976
min    79.000000  81.000000  89.000000
25%    82.000000  89.000000  91.250000
50%    85.500000  90.000000  92.000000
75%    89.750000  91.750000  93.500000
max    96.000000  95.000000  95.000000